# W04 Cassandra Python Tutorial

### Import packages

In [1]:
import pandas as pd
from cassandra.cluster import Cluster # be sure to install cassandra-driver (not just cassandra)

ModuleNotFoundError: No module named 'cassandra'

### Create a session connection to Cassandra cluster

In [2]:
clstr = Cluster()
session = clstr.connect()

### Use session to 'talk' to cassandra

In [3]:
session.execute("DROP KEYSPACE IF EXISTS w04python")

In [4]:
rows = session.execute("desc keyspaces")
for row in rows:
    print(f"{row[0]}")

system
system_auth
system_distributed
system_schema
system_traces
system_views
system_virtual_schema

In [5]:
session.execute("""
    CREATE KEYSPACE IF NOT EXISTS w04python WITH REPLICATION = {
        'class':'SimpleStrategy', 
        'replication_factor':3
    }
""")

In [6]:
rows = session.execute("desc keyspaces")
for row in rows:
    print(f"{row[0]}")

system
system_auth
system_distributed
system_schema
system_traces
system_views
system_virtual_schema
w04python

Create a student table for testing

In [7]:
session.execute("""
CREATE TABLE IF NOT EXISTS w04python.student ( 
    student_id INT, 
    f_name TEXT, 
    l_name TEXT, 
    course TEXT,
    grade FLOAT, 
    PRIMARY KEY(course, grade, student_id)
);
""")

### Load data

In [8]:
df = pd.read_csv('w04.csv')
df

    student_id    f_name       l_name     course  grade
0         1000     'Tim'      'Smith'  'ISM6562'     95
1         1001    'John'      'Jones'  'ISM6562'     97
2         1002    'Jane'   'Williams'  'ISM6562'     89
3         1003   'Betty'    'Johnson'  'ISM6564'     78
4         1004     'Jim'       'Bean'  'ISM6564'     65
5         1005   'Frank'    'Gambali'  'ISM6564'     97
6         1006    'Judy'    'Garland'  'ISM6564'     83
7         1007     'Tom'    'Garland'  'ISM6564'     79
8         1008    'Bill'    'Garland'  'ISM6564'     56
9         1009     'Tom'      'Jones'  'ISM6564'     34
10        1010   'Bruce'  'Dickenson'  'ISM6562'     87
11        1011   'Randy'     'Rhoads'  'ISM6562'     87
12        1012  'Edward'  'Van Halen'  'ISM6562'     87
13        1013    'John'       'Five'  'ISM6562'     87
14        1014   'Marty'   'Friedman'  'ISM6562'     87
15        1015    'Jake'        'Lee'  'ISM6562'     87
16        1016   'Steve'        'Via'  'ISM6136'     87
17        1017    'Judy'   'Lonestar'  'ISM6136'     87
18        1018    'Judy'        'Doe'  'ISM6136'     99
19        1019   'Trudy'        'Doe'  'ISM6136'     58
20        1020    'Bill'      'Jones'  'ISM6136'     81

In [10]:
for index, row in df.iterrows():
    print(f"student_id = {row.student_id}, f_name ={row.f_name}, l_name = {row.l_name}, course = {row.course}, grade = {row.grade}")

student_id = 1000, f_name ='Tim', l_name = 'Smith', course = 'ISM6562', grade = 95
student_id = 1001, f_name ='John', l_name = 'Jones', course = 'ISM6562', grade = 97
student_id = 1002, f_name ='Jane', l_name = 'Williams', course = 'ISM6562', grade = 89
student_id = 1003, f_name ='Betty', l_name = 'Johnson', course = 'ISM6564', grade = 78
student_id = 1004, f_name ='Jim', l_name = 'Bean', course = 'ISM6564', grade = 65
student_id = 1005, f_name ='Frank', l_name = 'Gambali', course = 'ISM6564', grade = 97
student_id = 1006, f_name ='Judy', l_name = 'Garland', course = 'ISM6564', grade = 83
student_id = 1007, f_name ='Tom', l_name = 'Garland', course = 'ISM6564', grade = 79
student_id = 1008, f_name ='Bill', l_name = 'Garland', course = 'ISM6564', grade = 56
student_id = 1009, f_name ='Tom', l_name = 'Jones', course = 'ISM6564', grade = 34
student_id = 1010, f_name ='Bruce', l_name = 'Dickenson', course = 'ISM6562', grade = 87
student_id = 1011, f_name ='Randy', l_name = 'Rhoads', course = 'ISM6562', grade = 87
student_id = 1012, f_name ='Edward', l_name = 'Van Halen', course = 'ISM6562', grade = 87
student_id = 1013, f_name ='John', l_name = 'Five', course = 'ISM6562', grade = 87
student_id = 1014, f_name ='Marty', l_name = 'Friedman', course = 'ISM6562', grade = 87
student_id = 1015, f_name ='Jake', l_name = 'Lee', course = 'ISM6562', grade = 87
student_id = 1016, f_name ='Steve', l_name = 'Via', course = 'ISM6136', grade = 87
student_id = 1017, f_name ='Judy', l_name = 'Lonestar', course = 'ISM6136', grade = 87
student_id = 1018, f_name ='Judy', l_name = 'Doe', course = 'ISM6136', grade = 99
student_id = 1019, f_name ='Trudy', l_name = 'Doe', course = 'ISM6136', grade = 58
student_id = 1020, f_name ='Bill', l_name = 'Jones', course = 'ISM6136', grade = 81

In [11]:
for index, row in df.iterrows():
    print(f"""
        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)     
        VALUES ({row.student_id}, {row.f_name}, {row.l_name}, {row.course}, {row.grade});
        """
    )
    session.execute(f"""
        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)     
        VALUES ({row.student_id}, {row.f_name}, {row.l_name}, {row.course}, {row.grade});
        """
    )

        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1000, 'Tim', 'Smith', 'ISM6562', 95);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1001, 'John', 'Jones', 'ISM6562', 97);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1002, 'Jane', 'Williams', 'ISM6562', 89);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1003, 'Betty', 'Johnson', 'ISM6564', 78);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1004, 'Jim', 'Bean', 'ISM6564', 65);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1005, 'Frank', 'Gambali', 'ISM6564', 97);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1006, 'Judy', 'Garland', 'ISM6564', 83);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1007, 'Tom', 'Garland', 'ISM6564', 79);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1008, 'Bill', 'Garland', 'ISM6564', 56);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1009, 'Tom', 'Jones', 'ISM6564', 34);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1010, 'Bruce', 'Dickenson', 'ISM6562', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1011, 'Randy', 'Rhoads', 'ISM6562', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1012, 'Edward', 'Van Halen', 'ISM6562', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1013, 'John', 'Five', 'ISM6562', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1014, 'Marty', 'Friedman', 'ISM6562', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1015, 'Jake', 'Lee', 'ISM6562', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1016, 'Steve', 'Via', 'ISM6136', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1017, 'Judy', 'Lonestar', 'ISM6136', 87);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1018, 'Judy', 'Doe', 'ISM6136', 99);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1019, 'Trudy', 'Doe', 'ISM6136', 58);


        INSERT INTO w04python.student (student_id, f_name, l_name, course, grade)
        VALUES (1020, 'Bill', 'Jones', 'ISM6136', 81);

In [15]:
rows = session.execute("select (student_id, f_name, l_name, course, grade) from w04python.student")
for row in rows:
    print(f"student_id={row[0][0]}, f_name={row[0][1]}, l_name={row[0][2]}, grade={row[0][3]}, grade={row[0][4]}")

student_id=1019, f_name=Trudy, l_name=Doe, grade=ISM6136, grade=58.0
student_id=1020, f_name=Bill, l_name=Jones, grade=ISM6136, grade=81.0
student_id=1016, f_name=Steve, l_name=Via, grade=ISM6136, grade=87.0
student_id=1017, f_name=Judy, l_name=Lonestar, grade=ISM6136, grade=87.0
student_id=1018, f_name=Judy, l_name=Doe, grade=ISM6136, grade=99.0
student_id=1009, f_name=Tom, l_name=Jones, grade=ISM6564, grade=34.0
student_id=1008, f_name=Bill, l_name=Garland, grade=ISM6564, grade=56.0
student_id=1004, f_name=Jim, l_name=Bean, grade=ISM6564, grade=65.0
student_id=1003, f_name=Betty, l_name=Johnson, grade=ISM6564, grade=78.0
student_id=1007, f_name=Tom, l_name=Garland, grade=ISM6564, grade=79.0
student_id=1006, f_name=Judy, l_name=Garland, grade=ISM6564, grade=83.0
student_id=1005, f_name=Frank, l_name=Gambali, grade=ISM6564, grade=97.0
student_id=1010, f_name=Bruce, l_name=Dickenson, grade=ISM6562, grade=87.0
student_id=1011, f_name=Randy, l_name=Rhoads, grade=ISM6562, grade=87.0
student_id=1012, f_name=Edward, l_name=Van Halen, grade=ISM6562, grade=87.0
student_id=1013, f_name=John, l_name=Five, grade=ISM6562, grade=87.0
student_id=1014, f_name=Marty, l_name=Friedman, grade=ISM6562, grade=87.0
student_id=1015, f_name=Jake, l_name=Lee, grade=ISM6562, grade=87.0
student_id=1002, f_name=Jane, l_name=Williams, grade=ISM6562, grade=89.0
student_id=1000, f_name=Tim, l_name=Smith, grade=ISM6562, grade=95.0
student_id=1001, f_name=John, l_name=Jones, grade=ISM6562, grade=97.0

In [13]:
rows = session.execute("select (l_name, f_name, grade) from w04python.student where grade > 80 ALLOW FILTERING")
for row in rows:
    print(f"{row[0][0]}, {row[0][1]}, {row[0][2]}")

Jones, Bill, 81.0
Via, Steve, 87.0
Lonestar, Judy, 87.0
Doe, Judy, 99.0
Garland, Judy, 83.0
Gambali, Frank, 97.0
Dickenson, Bruce, 87.0
Rhoads, Randy, 87.0
Van Halen, Edward, 87.0
Five, John, 87.0
Friedman, Marty, 87.0
Lee, Jake, 87.0
Williams, Jane, 89.0
Smith, Tim, 95.0
Jones, John, 97.0

In [ ]:
rows = session.execute("select token(course), student_id, f_name, l_name from w04python.student;")
for row in rows:
    print(f"{row[0][0]}, {row[0][1]}, {row[0][2]}, {row[0][3]}")

## Challenge

Let's say we want to select all students with a grade higher than 90 but without requiring ALLOW FILTERING

Can you come up with a way to to do this?

Here are some resources to help you better understand cassandra ALLOW FILTERING and indexing (there are many other resources online):

> For more informaiton on ALLOW FILTERING see: https://www.datastax.com/blog/allow-filtering-explained